{
  "meta": {
    "theme": "orbit-original"
  },
  "basics": {
    "name": "Thomas Hallock",
    "label": "",
    "picture": "",
    "email": "hallock@gmail.com",
    "phone": "+1.512.775.6652",
    "website": "http://thomashallock.com/",
    "summary": "Software Engineer since before the web",
    "location": {
      "address": "",
      "postalCode": "98122",
      "city": "Seattle, WA",
      "countryCode": "USA",
      "region": "Washington"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Compass",
      "position": "Senior Software Engineer II (IC4)",
      "website": "",
      "startDate": "2019-05-01",
      "summary": "Engineering lead for team of 4 on comparative market analysis project, built from scratch a suite of web applications for real estate agents to use to create nice-looking reports that compares their client's property to similar properties. Used React, koa, GraphQL, and Redis and modern patterns for universal rendering, state management and css.  Wrote a web application that all other teams could use for anytime deploys to EKS (kubernetes) as an alternative to the existing monolithic deployment pattern that used cron + ec2.  Built a web application that made it quick and easy for stakeholders to create incidents (on PagerDuty and OpsGenie) for production-level failures in our on-call systems.  GraphQL: Implemented the first production-level GraphQL application in the org and set an example for five other projects that followed in the following months. Advocated for the technology and demonstrated several practical patterns that other teams were able to leverage in the following months in order to bring their applications to production.  Onboarded new ~20 new hires so they could become productive on their first day in the new Seattle office  Reduced logging volume by 2/3rds by finding wasteful instances of logging throughout the organization's codebases. Developed and documented a few novel techniques for detecting wasteful logging.  Ensured that all front-end applications across the org were correctly integrated with DataDog's custom metrics, logging, and APM services.",
      "highlights": []
    },
    {
      "company": "Providence Health & Services",
      "position": "Senior Software Engineer",
      "website": "",
      "startDate": "2017-01-01",
      "summary": "Designed and implemented web application for uploading correctly sized and oriented insurance cards to EPIC scheduling system. Internationalized several projects using plugins and middleware based on i18n. Integrated reature flagging vai launch darkly into several products",
      "highlights": [],
      "endDate": "2019-01-01"
    },
    {
      "company": "1stdibs.com",
      "position": "Sr. Front End Engineer",
      "website": "",
      "startDate": "2014-01-01",
      "summary": "Created and launched MessageCenter, a web email system for communication and commerce between customers and dealers on 1stdibs.com. Introduced development team to best practices for source control with git. Delivered multiple best-practices themed presentations to development team covering source control and software testing strategies. Wrote tools for organizing front-end codebase into self-contained view components.",
      "highlights": [],
      "endDate": "2016-01-01"
    },
    {
      "company": "Kaplan",
      "position": "Senior Software Engineer",
      "website": "",
      "startDate": "2012-01-01",
      "summary": "Front-end engineer for Learningpod.com",
      "highlights": [],
      "endDate": "2013-01-01"
    },
    {
      "company": "Roubini Global Economics",
      "position": "Senior Software Engineer",
      "website": "",
      "startDate": "2010-01-01",
      "summary": "",
      "highlights": [],
      "endDate": "2012-01-01"
    },
    {
      "company": "Black Enterprise",
      "position": "Web Developer / Administrator",
      "website": "",
      "startDate": "2009-07-01",
      "summary": "Web systems administrator and developer",
      "highlights": [],
      "endDate": "2010-02-01"
    },
    {
      "company": "FordDirect",
      "position": "Support Team Manager",
      "website": "",
      "startDate": "2007-10-01",
      "summary": "",
      "highlights": [],
      "endDate": "2009-05-01"
    },
    {
      "company": "Versata",
      "position": "Support Manager - Automotive Business Unit",
      "website": "",
      "startDate": "2007-10-01",
      "summary": "Manged a call center that provided support for a large consumer facing web application. Created documentation for new software releases. Administrated a domain name server for over 6000 domain names. Trained call center as part of each release cycle.",
      "highlights": [],
      "endDate": "2008-12-01"
    },
    {
      "company": "Medicus Insurance Company",
      "position": "Systems Administrator",
      "website": "",
      "startDate": "2007-01-01",
      "summary": "Designed, built, and maintained IT infrastructure for a group of 25 users. Mostly Mac OS X Server-based. Implemented LDAP-based authentication across all services, managed e-mail migrations across three different platforms over a period of one year.",
      "highlights": [],
      "endDate": "2008-01-01"
    },
    {
      "company": "The Sellery",
      "position": "Owner",
      "website": "",
      "startDate": "2004-01-01",
      "summary": "Architected an eBay consignment business model from scratch, wrote software that manges inventory, consignors, employees, and finances. Launched advertising campaigns, recruited workers, integrated systems, and most importantly, maintained profitability, all while working full-time as an IT consultant for other companies.",
      "highlights": [],
      "endDate": "2011-01-01"
    },
    {
      "company": "Aspyr Media",
      "website": "https://www.aspyr.com/",
      "startDate": "2001-01-01",
      "summary": "",
      "highlights": [],
      "endDate": "2003-01-01"
    }
  ],
  "education": [
    {
      "institution": "Universirty of Texas at Austin",
      "area": "Compter Science",
      "studyType": "B.S.",
      "startDate": "1998-01-01",
      "gpa": "",
      "courses": [],
      "endDate": "2002-01-01"
    }
  ],
  "skills": [
    {
      "name": "Web Applications",
      "level": "10",
      "keywords": []
    },
    {
      "name": "JavaScript",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Git",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Node.js",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Application Development",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Haskell",
      "level": "4",
      "keywords": []
    },
    {
      "name": "MySQL",
      "level": "6",
      "keywords": []
    },
    {
      "name": "CouchDB",
      "level": "4",
      "keywords": []
    },
    {
      "name": "Software Documentation",
      "level": "6",
      "keywords": []
    },
    {
      "name": "Intergalactic Tourism",
      "level": "0",
      "keywords": []
    },
    {
      "name": "Grails",
      "level": "2",
      "keywords": []
    },
    {
      "name": "Groovy",
      "level": "2",
      "keywords": []
    },
    {
      "name": "MongoDB",
      "level": "3",
      "keywords": []
    },
    {
      "name": "Bash",
      "level": "7",
      "keywords": []
    },
    {
      "name": "XML",
      "level": "3",
      "keywords": []
    },
    {
      "name": "Linux",
      "level": "3",
      "keywords": []
    },
    {
      "name": "PHP",
      "level": "8",
      "keywords": []
    },
    {
      "name": "Python",
      "level": "4",
      "keywords": []
    },
    {
      "name": "Web Development",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Software Development",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Subversion",
      "level": "6",
      "keywords": []
    },
    {
      "name": "jQuery",
      "level": "10",
      "keywords": []
    },
    {
      "name": "SQL",
      "level": "7",
      "keywords": []
    },
    {
      "name": "HTML",
      "level": "10",
      "keywords": []
    },
    {
      "name": "CSS",
      "level": "10",
      "keywords": []
    },
    {
      "name": "JSON",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Apache",
      "level": "8",
      "keywords": []
    },
    {
      "name": "REST",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Java",
      "level": "6",
      "keywords": []
    },
    {
      "name": "Kubernetes",
      "level": "6",
      "keywords": []
    },
    {
      "name": "React.js",
      "level": "10",
      "keywords": []
    },
    {
      "name": "Redis",
      "level": "7",
      "keywords": []
    },
    {
      "name": "Front-end Development",
      "level": "10",
      "keywords": []
    }
  ],
  "references": [
    {
      "name": "Chi Ho - Compass",
      "reference": "Thomas is passionate about technologies.  He is a go to person for many questions about GraphQL, React, or any of the various tools that our team uses (e.g., Datadog, PagerDuty, etc.).  Thomas is a great teacher and a helpful colleague.  He goes above and beyond to not only answer our questions, but also to get us interested in the subject technology.  And he helped our very young team with big and small tasks, ranging from onboarding new team members to setting up a deployment pipeline when there was no clear process, to giving an important product a good start.  I am personally very impressed with his knowledge, as well as thankful for his contribution to the team's early success."
    },
    {
      "name": "Allen Velasquez - Noble Systems",
      "reference": "Thomas was a smart, diligent and affable customer support rep when I worked at him at Aspyr. Despite being (in my opinion) overqualified for the job he still committed and gave every aspect its' due diligence and was a pleasure to work with."
    },
    {
      "name": "Charlie Palermo - comfort air solutions",
      "reference": "I have used Thomas to sell a variety of items in the past four years. He has proven marketing skills that get results. I will continue to consign my items over to Thomas and I highly recommend him to anyone wishing to get the best price for their merchandise.    I would also like to add that Thomas is a man  with high moral standards and a strong work ethic.      Charlie Palermo   Round Rock, Tx"
    },
    {
      "name": "Steven McPike - Broadway Technology",
      "reference": "As the team's Support Manager, Thomas was a key liaison between our end-users, call center agents, developers, and project sponsor.  He had responsibility for a wide variety of tasks, ranging from onsite training to running triage sessions with our operations team.  He excelled in this diverse role due to a strong blend of communication skills, technical aptitude, attention to detail, and work ethic.  Of particular note, Thomas consistently sought to identify opportunities for improving team processes and helping drive customer success."
    },
    {
      "name": "Pratibha Hottigimath - Pacific Gas & Electric / PG&E",
      "reference": "Thomas has a strong understanding of technology and can gauge project needs effectively. It is easy to see his deep commitment in everything he does.   Thomas maintains a good feel of customer needs and proposes enhancements to address them.  Thomas is certainly a great contributor and would be an asset to any team."
    },
    {
      "name": "Sonny Bihl - OnlineMedEd",
      "reference": "I've worked with Thomas for well over a year. During that time, Thomas has been the technical expert and consumate professional. He is a master of technology, while remaining accessible and helpful whenever needed. Thomas has always been thorough and patient while training my teams in new features and updates. The success of my team has been largely due to the efforts and helpfulness of Thomas."
    }
  ]
}
